EPSILON = 1E-3
DELTA_AMOUNT = 0.1                  # Степень нечеткости при фаззификации в % / 100
CRISP_AMOUNT = 0.02                  # Степень абсолютной принадлежности при фаззификации в % / 100
STD_LING_COUNT = 6                   # Количество стандартных наборов термов

# Стандартные имена термов
StdLingNames = [
    ["очень_низкий", "низкий", "средне_низкий", "средний", "средне_высокий", "высокий", "очень_высокий"],
    ["крайне_отрицательный", "отрицательный", "слабо_отрицательный", "нулевой", "слабо_положительный",
     "положительный", "сильно_положительный"],
    ["сильное_снижение", "снижение", "слабое_снижение", "постоянно", "слабое_повышение", "повышение",
     "сильное_повышение"],
    ["VL", "L", "ML", "M", "MH", "H", "VH"],
    ["VN", "N", "SN", "Z", "SP", "P", "VP"],
    ["HN", "N", "LN", "Z", "LP", "P", "HP"]
]

# Типы данных
Membership = float  # Тип значений степени принадлежности
BaseSet = float     # Тип значений базового множества
Natural = int       # Беззнаковый тип индекса и размера массивов
